app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `email` = 'Althea@gmail.com'
 LIMIT 1
---
    public function submit()
    {
        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $userModel = new \App\Models\UserModel();
        $user = $userModel->where('email', $email)->first();