app/Controllers/Profile.php

SELECT *
FROM `users`
WHERE `users`.`id` = '13'
---
    public function index()
    {
        $session = session();

        // require login
        if (! $session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        // common session keys: user_id or id
        $userId = $session->get('user_id') ?? $session->get('id');
        if (! $userId) {
            return redirect()->to('/login');
        }

        $userModel = new UserModel();
        $user = $userModel->find($userId);

SELECT *
FROM `users`
WHERE `users`.`id` = '13'
---
    public function submit()
{
    $session = session();

    // require login
    if (!$session->get('isLoggedIn')) {
        return redirect()->to('/login');
    }

    $userId = $session->get('user_id') ?? $session->get('id');
    if (!$userId) {
        return redirect()->to('/login');
    }

    $post = $this->request->getPost();

    // Get current user data to check against
    $userModel = new \App\Models\UserModel(); // Use your actual model name
    $currentUser = $userModel->find($userId);

UPDATE `users` SET `name` = 'Nikki1', `email` = 'Nikko1@gmail.com'
WHERE `users`.`id` IN ('13')
---
    }

    // Update the user
    if ($userModel->update($userId, $userData)) {