app/Controllers/RegisterForm.php

INSERT INTO `users` (`name`, `email`, `password`) VALUES ('Nikko', 'Nikko@gmail.com', '$2y$10$.cXAuOHurn7Mwj74ePF5y.RTSEBR2j3w6bhH/N/6jOMV6m0FVW7hO')
---
    public function submit()
    {
        helper(['form', 'url']);
        $userModel = new UserModel();

        $validationRules = [
            'name' => 'required|min_length[3]|max_length[20]',
            'email'    => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[6]',
            'confirm'  => 'required|matches[password]'
        ];

        if (!$this->validate($validationRules)) {
            echo view('auth/register', ['validation' => $this->validator]);
        } else {
            // Prepare sanitized data
            $data = [
                'name' => $this->request->getPost('name'),
                'email'    => $this->request->getPost('email'),
                'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT)
            ];

            // Insert data into database
            $userModel->insert($data);